Revit 2020 API
SchemaCommon Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class SchemaCommon
Visual Basic
Public NotInheritable Class SchemaCommon
Visual C++
public ref class SchemaCommon abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.SchemaCommon
See Also
SchemaCommon Members
Autodesk.Revit.DB.Visual Namespace